tap "1password/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "k-nasa/tap"
tap "ynqa/tap"

cask "1password"
cask "1password-cli"
cask "alfred"
cask "appzapper"
cask "brave-browser"
cask "dash"
cask "docker"
cask "dropbox"
cask "fork"
cask "iterm2@beta"
cask "jordanbaird-ice"
cask "macdown"
cask "piezo"
cask "signal"
cask "the-unarchiver"

# brew "aws-shell"
# brew "awscli"
# brew "hadolint"
# brew "helm"
# brew "kcat"
# brew "kubernetes-cli"
# brew "magic-wormhole"

brew "bash"
brew "bash-completion@2"
brew "colordiff"
brew "coreutils"
brew "csvkit"
brew "dive"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "gnu-sed"
brew "go"
brew "gopls"
brew "gotags"
brew "gping"
brew "hey"
brew "htop"
brew "jnv"
brew "jq"
brew "mas"
brew "mmv"
brew "mtr"
brew "nmap"
brew "pgformatter"
brew "rbenv"
brew "rbenv-aliases"
brew "rbenv-default-gems"
brew "ripgrep"
brew "ruby-build"
brew "tmate"
brew "tmux"
brew "trash", link: true
brew "vim"
brew "wget"
brew "xz"
brew "yt-dlp"
brew "yq"

mas "Amphetamine", id: 937984704
mas "DaisyDisk", id: 411643860
mas "GIPHY CAPTURE", id: 668208984
mas "Magnet", id: 441258766
mas "Pixelmator", id: 407963104
mas "Pixelmator Pro", id: 1289583905
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
