require "socket"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

cask "1password"
cask "alfred"
cask "appzapper"
cask "dash"
cask "dropbox"
cask "fork"
cask "flux"
cask "google-chrome"
cask "iterm2-beta"
cask "macdown"
cask "spotify"
cask "the-unarchiver"

brew "bash"
brew "bash-completion@2"
brew "colordiff"
brew "coreutils"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "htop"
brew "imagemagick"
brew "jq"
brew "jsonpp"
brew "mas"
brew "mmv"
brew "mtr"
brew "nmap"
brew "rbenv"
brew "rbenv-aliases"
brew "rbenv-default-gems"
brew "roundup"
brew "ruby-build"
brew "the_silver_searcher"
brew "trash"
brew "tmux"
brew "vim"
brew "wget"

mas "Amphetamine", id: 937984704
mas "GIF Brewery 3", id: 1081413713
mas "GIPHY CAPTURE", id: 668208984
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
mas "iMovie", id: 408981434

if ["Stickers"].include?(Socket.gethostname)
  cask "piezo"
  cask "powerphotos"
  cask "signal"
  cask "superduper"
  cask "arq"
  cask "java" 
  cask "ngrok" 
  brew "libsass"
  brew "libxml2"
  brew "libxmlsec1"
  brew "node"
  brew "redis"
  brew "rbspy"
  cask "chromedriver"
  cask "docker"
  cask "postgres"
  cask "virtualbox"
end
