require "socket"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

cask "1password"
cask "alfred"
cask "appzapper"
cask "arq"
cask "dash"
cask "dropbox"
cask "flux"
cask "google-chrome"
cask "imageoptim"
cask "iterm2-beta"
cask "macdown"
cask "max"
cask "piezo"
cask "powerphotos"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-json"
cask "spotify"
cask "superduper"
cask "the-unarchiver"

brew "bash"
brew "bash-completion@2"
brew "colordiff"
brew "coreutils"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "htop"
brew "imagemagick"
brew "jq"
brew "jsonpp"
brew "mas"
brew "mmv"
brew "mtr"
brew "nmap"
brew "rbenv"
brew "rbenv-aliases"
brew "rbenv-default-gems"
brew "roundup"
brew "ruby-build"
brew "the_silver_searcher"
brew "trash"
brew "tmux"
brew "vim"
brew "wget"

mas "1Blocker", id: 1107421413
mas "Amphetamine", id: 937984704
mas "Cascadea", id: 1432182561
mas "GIF Brewery 3", id: 1081413713
mas "GIPHY CAPTURE", id: 668208984
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
mas "iMazing HEIC Converter", id: 1292198261
mas "iMovie", id: 408981434

if ["phallstrom-l2.corp.instructure.com", "Stickers"].include?(Socket.gethostname)
  cask "java" 
  brew "clojure"
  brew "leiningen"
  brew "libsass"
  brew "libxml2"
  brew "libxmlsec1"
  brew "node@8"
  brew "redis"
  brew "rbspy"
  cask "chromedriver"
  cask "docker"
  cask "postgres"
  cask "virtualbox"
end

if ["phallstrom-l2.corp.instructure.com"].include?(Socket.gethostname)
  tap "codekitchen/dinghy"
  tap "rwstauner/ynetd"
  brew "ansible"
  brew "awscli"
  brew "codekitchen/dinghy/unfs3"
  brew "openconnect"
  brew "tfenv"
  brew "vault"
  brew "vaulted"
  brew "xhyve"
  brew "ynetd"
end
